Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Replace Method
Overload List
Name | Description
Replace(Int32, Arc)
 Replaces the geometry at a given index
Replace(Int32, LineSegment)
 Replaces the geometry at a given index
Top
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace